class Instruct:
    """指令id"""

    """
    =========================
    对话类指令
    =========================
    """
    CHAT = 0
    """ 闲聊 """
    ABUSE = 0
    """ 辱骂 """
    GENERAL_SPEECH = 1
    """ 演讲 """

    """
    =========================
    主动类指令
    =========================
    """
    EAT = 0
    """ 进食 """
    MOVE = 0
    """ 移动 """
    BUY_ITEM = 0
    """ 购买道具 """
    BUY_FOOD = 0
    """ 购买食物 """
    BUY_CLOTHING = 0
    """ 购买服装 """
    DRINK_SPRING = 0
    """ 喝泉水 """
    EMBRACE = 0
    """ 拥抱 """
    HAND_IN_HAND = 0
    """ 牵手 """
    LET_GO = 0
    """ 放手 """
    WEAR = 0
    """ 穿衣 """
    SELF_UNDRESS = 0
    """ 脱自己的衣服 """
    SEE_STAR = 0
    """ 看星星 """
    CLUB_ACTIVITY = 0
    """ 社团活动 """

    """
    =========================
    表演类指令
    =========================
    """
    SINGING = 0
    """ 唱歌 """
    DANCE = 0
    """ 跳舞 """
    PLAY_PIANO = 0
    """ 弹钢琴 """
    PLAY_GUITAR = 0
    """ 弹吉他 """

    """
    =========================
    猥亵类指令
    =========================
    """
    TOUCH_HEAD = 0
    """ 摸头 """
    KISS = 0
    """ 亲吻 """
    STROKE = 0
    """ 抚摸 """
    TOUCH_CHEST = 0
    """ 摸胸 """
    TARGET_UNDRESS = 0
    """ 脱下对方衣服 """
    STALKER = 0
    """ 尾行 """

    """
    =========================
    娱乐类指令
    =========================
    """
    PLAY_COMPUTER = 0
    """ 玩电脑 """
    DRAW = 0
    """ 画画 """
    RUN = 0
    """ 跑步 """

    """
    =========================
    战斗类指令
    =========================
    """

    """
    =========================
    学习类指令
    =========================
    """
    VIEW_THE_SCHOOL_TIMETABLE = 0
    """ 查看课程表 """
    ATTEND_CLASS = 0
    """ 上课 """
    TEACH_A_LESSON = 0
    """ 教课 """
    SELF_STUDY = 0
    """ 自习 """

    """
    =========================
    休息类指令
    =========================
    """
    REST = 0
    """ 休息 """
    SIESTA = 0
    """ 午睡 """
    SLEEP = 0
    """ 睡觉 """

    """
    =========================
    性爱类指令
    =========================
    """
    MASTURBATION = 0
    """ 手淫 """
    MISSIONARY_POSITION = 0
    """ 正常位 """

    """
    =========================
    系统类指令
    =========================
    """
    SEE_ATTR = 0
    """ 查看属性 """
    SEE_OWNER_ATTR = 0
    """ 查看自身属性 """
    VIEW_CHARACTER_STATUS_LIST = 0
    """ 查看角色状态列表 """
    VIEW_CLUB_LIST = 0
    """ 查看社团列表 """
    VIEW_CLUB_INFO = 0
    """ 查看社团信息 """
    COLLECTION_CHARACTER = 0
    """ 收藏角色 """
    UN_COLLECTION_CHARACTER = 0
    """ 取消收藏 """
    COLLECTION_SYSTEM = 0
    """ 启用收藏模式 """
    UN_COLLECTION_SYSTEM = 0
    """ 关闭收藏模式 """
    SAVE = 0
    """ 读写存档 """
